# St7GetLinkLabelStyle

Returns the display style for link labels.

long St7GetLinkLabelStyle(long uID, long* LabelStyle)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
LabelStyle

One of lsNone, lsEntityNumber, lsIDNumber, or lsLinkType.

Link Entity Display